perf/all.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    - name: Ramp2
      duration: 30
      arrivalRate: 5
      rampTo: 10
    - name: Plain2
      duration: 60
      arrivalRate: 10
    - name: Unload
      duration: 30
      arrivalRate: 10
      rampTo: 0

scenarios:
  - name: GET ALL
    flow:
      - get:
          url: "/ping"
      - get:
          url: "/fact"
      - get:
          url: "/space_news"