perf/fact_load.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp up load 2
      duration: 30
      arrivalRate: 50
      rampTo: 100
    - name: Plain load 2
      duration: 30
      arrivalRate: 100
    - name: Ramp up load 3
      duration: 30
      arrivalRate: 100
      rampTo: 150
    - name: Plain load 3
      duration: 30
      arrivalRate: 150
    - name: Ramp up load 4
      duration: 30
      arrivalRate: 150
      rampTo: 200
    - name: Plain load 4
      duration: 30
      arrivalRate: 200
    - name: Ramp up load 5
      duration: 30
      arrivalRate: 200
      rampTo: 250
    - name: Plain load 5
      duration: 30
      arrivalRate: 250
    # Hasta aca bien, median 750ms
    # Luego Empiezo a tener timeouts
    - name: Load Spike
      duration: 60
      arrivalRate: 350

scenarios:
  - name: Fact
    flow:
      - get:
          url: "/fact"