perf/metar.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      payload:
        path: "stations.csv"
        fields:
          - "code"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 30
      arrivalRate: 5
    - name: Ramp up load
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: Plain load
      duration: 60
      arrivalRate: 50
    - name: Ramp up load 2
      duration: 60
      arrivalRate: 50
      rampTo: 100
    - name: Plain load 2
      duration: 60
      arrivalRate: 50
    - name: Load Spike
      duration: 60
      arrivalRate: 200

scenarios:
  - name: Metar Load
    flow:
      - get:
          url: "/metar?station={{ code }}"