perf/metar_load.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      payload:
        path: "stations.csv"
        order: sequence
        fields:
          - "code"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp up load
      duration: 30
      arrivalRate: 10
      rampTo: 60
    - name: Plain load
      duration: 30
      arrivalRate: 60
    - name: Ramp up load 2
      duration: 30
      arrivalRate: 60
      rampTo: 120
    - name: Plain load 2
      duration: 30
      arrivalRate: 120
    - name: Ramp up load 3
      duration: 30
      arrivalRate: 120
      rampTo: 240
    - name: Plain load 3
      duration: 30
      arrivalRate: 240
    # Hasta aca bien, median 58 ms
    - name: Ramp up load 4
      duration: 30
      arrivalRate: 240
      rampTo: 300
    - name: Plain load 4
      duration: 30
      arrivalRate: 300
    # Empiezo a recibir solo timeouts
    - name: Load Spike
      duration: 60
      arrivalRate: 350

scenarios:
  - name: Metar
    flow:
      - get:
          url: "/metar?station={{ code }}"